       IDENTIFICATION DIVISION.
       PROGRAM-ID. LAB3CAREY.
       AUTHOR. Ruc230.
      *>Cash register lab
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-ITEMDATA.
           02 WS-PRICE PIC 9(4)V9(2).
           02 WS-ITEMQUANTITY PIC 9(4).
           02 WS-DESC PIC X(50).
	   01  WS-TALLYDATA
           02 WS-TOTALQUANTITY PIC 9(4).
		   02 WS-TEMPPRICE PIC 9(4)V9(2).
           02 WS-DISCOUNT PIC V9 VALUE .8.
           02 WS-TOTALPRICE PIC 9(5)V9(2).
		   02 WS-CONTINUE PIC X.
       PROCEDURE DIVISION.
       LAB3CAREY.
           DISPLAY "Welcome to the Carey shop".
		   DISPLAY "Enter item description:".
           ACCEPT WS-DESC.
           DISPLAY "Enter item price:"
		   ACCEPT WS-PRICE.
		   DISPLAY "Enter quantity:".
		   ACCEPT WS-ITEMQUANTITY.
		   MULTIPLY WS-ITEMQUANTITY BY WS-PRICE GIVING WS-TEMPPRICE.
		   COMPUTE WS-TOTALPRICE = WS-TOTALPRICE + WS-TEMPPRICE.
		   DISPLAY WS-DESC"     "WS-PRICE"    "WS-ITEMQUANTITY"    "WS-TOTALPRICE.
		   DISPLAY "More items? (Y/N)".
		   ACCEPT WS-CONTINUE.
		IF WS-CONTINUE IS EQUAL TO "Y" THEN
		   GO TO LAB3CAREY.
           STOP RUN.
           END PROGRAM LAB3CAREY.