       IDENTIFICATION DIVISION.
       PROGRAM-ID. LAB4CAREY.
       AUTHOR. Ruc230.
      *>salary lab
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT EMPLOYEEFILE ASSIGN TO "EMPFILE.DAT"
        FILE STATUS IS FILE-CHECK-KEY
        ORGANIZATION IS LINE SEQUENTIAL.
       SELECT OUTPUTFILE ASSIGN TO "EMPREPORT.LPT"
        ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEEFILE.
       01 EMPDETAILS.
            88 ENDOFFILE VALUE HIGH-VALUES.
            02 EMPID PIC 9(7).
            02 EMPNAME.
                03 LASTNAME PIC X(10).
                03 FIRSTNAME PIC X(10).
            02 STARTDATTE.
                03 STARTYEAR PIC 9(4).
                03 STARTMONTH PIC 9(2).
                03 STARTDAY PIC 9(2).
            02 SALARY PIC 9(9).
            02 GENDER PIC X.
       WORKING-STORAGE SECTION.
       01 WS-VARS.
           05 TOTALSALARY PIC 9(12) VALUE ZERO.
           05 FILE-CHECK-KEY PIC X(2).
       01 HEADLINE.
           05 FILLER PIC X(11) VALUE 'EMPLOYEE ID'.
           05 FILLER PIC X(2) VALUE SPACES.
           05 FILLER PIC X(16) VALUE 'EMPLOYEE NAME'.
           05 FILLER PIC X(4) VALUE SPACES.
           05 FILLER PIC X(10) VALUE 'START DATE'.
           05 FILLER PIC X(7) VALUE SPACES.
           05 FILLER PIC X(11) VALUE 'SALARY'.
           05 FILLER PIC X(71) VALUE SPACES.
       01 EMPDETAILS-TO-PRINT.
           05 PRINTEMPID PIC 9(7) VALUE ZEROES.
           05 FILLER PIC X(6) VALUE SPACES.
           05 PRINTFNAME PIC X(10) VALUE SPACES.
           05 PRINTLNAME PIC X(10) VALUE SPACES.
           05 PRINTSTARTDATE.
              06 PRINTMON PIC X(3) VALUE SPACES.
              06 FILLER PIC X VALUE '-'.
              06 PRINTDAY PIC X(2) VALUE SPACES.
              06 FILLER PIC X VALUE '-'.
              06 PRINTYEAR PIC X(4) VALUE SPACES.
           05 PRINTSALARY PIC $$$$,$$$,$$9 VALUE ZEROES.
           05 FILLER PIC X(76) VALUE SPACES.
       01 TOTAL-LINE.
          05 FILLER PIC X(29) VALUE SPACES.
          05 FILLER PIC X(10) VALUE 'TOTAL'.
          05 TOTAL PIC $,$$$,$$$,$$$,$$9.
          05 FILLER PIC X(76).
       01 EMPTY-LINE.
          05 FILLER PIC X(131) VALUE SPACES.
       PROCEDURE DIVISION.
           PERFORM 0100-GETEMPDATA.
           PERFORM 0200-PROCESS-EMPDATA UNTIL ENDOFFILE.
           WRITE EMPDETAILS-TO-PRINT FROM HEADLINE
              AFTER ADVANCING PAGE.
           DISPLAY HEADLINE.
           PERFORM 9999-ENDPROGRAM.
       0100-GETEMPDATA.
           OPEN INPUT EMPLOYEEFILE
           IF FILE-CHECK-KEY NOT = "00"
              DISPLAY "NON-ZERO FILE STATUS RETURNED: FAILURE TO OPEN ",
                 FILE-CHECK-KEY
              GO TO 9999-ENDPROGRAM
           END-IF.
           OPEN OUTPUT OUTPUTFILE.
           READ EMPLOYEEFILE
             AT END SET ENDOFFILE TO TRUE
           END-READ.
        0100-GETEMPDATA-END.
        0200-PROCESS-EMPDATA.
             MOVE EMPID TO PRINTEMPID.
             MOVE LASTNAME TO PRINTLNAME.
             MOVE FIRSTNAME TO PRINTFNAME.
             IF (STARTMONTH IS EQUAL TO 01)
                 SET PRINTMON TO "JAN"
             IF (STARTMONTH IS EQUAL TO 02)
                 SET PRINTMON TO "FEB"
             IF (STARTMONTH IS EQUAL TO 03)
                 SET PRINTMON TO "MAR"
             IF (STARTMONTH IS EQUAL TO 04)
                 SET PRINTMON TO "APR"
             IF (STARTMONTH IS EQUAL TO 05)
                 SET PRINTMON TO "MAY"
             IF (STARTMONTH IS EQUAL TO 06)
                 SET PRINTMON TO "JUN"
             IF (STARTMONTH IS EQUAL TO 07)
                 SET PRINTMON TO "JUL"
             IF (STARTMONTH IS EQUAL TO 08)
                 SET PRINTMON TO "AUG"
             IF (STARTMONTH IS EQUAL TO 09)
                 SET PRINTMON TO "SEP"
             IF (STARTMONTH IS EQUAL TO 10)
                 SET PRINTMON TO "OCT"
             IF (STARTMONTH IS EQUAL TO 11)
                 SET PRINTMON TO "NOV"
             IF (STARTMONTH IS EQUAL TO 01)
                 SET PRINTMON TO "DEC"
             ELSE
                 SET PRINTMON TO "NUL"
             END-IF.
             MOVE STARTDAY TO PRINTDAY.
             MOVE STARTYEAR TO PRINTYEAR.
             MOVE SALARY TO PRINTSALARY.
             COMPUTE SALARY = SALARY * 1.05.
             ADD SALARY TO TOTALSALARY.
             WRITE EMPDETAILS-TO-PRINT FROM EMPDETAILS
                AFTER ADVANCING 2 LINES.
             DISPLAY EMPDETAILS.
             READ EMPLOYEEFILE
               AT END SET ENDOFFILE TO TRUE
             END-READ.
        0200-PROCESS-EMPDATA-END.
        9999-ENDPROGRAM.
           CLOSE EMPLOYEEFILE.
           CLOSE OUTPUTFILE.
           STOP RUN.
           END PROGRAM LAB4CAREY.
        9999-ENDPROGRAM-END.